# SweptBlend Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptBlend Class
Members See Also
---
A swept blend solid or void form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SweptBlend : GenericForm
```

Visual Basic
---
```text
Public Class SweptBlend _
	Inherits GenericForm
```

Visual C++
---
```text
public ref class SweptBlend : public GenericForm
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CombinableElement Autodesk.Revit.DB..::..GenericForm Autodesk.Revit.DB..::..SweptBlend
# See Also
SweptBlend Members
Autodesk.Revit.DB Namespace